sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
#include <Arduino.h>
#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif
#define LGFX_USE_V1
#include <LovyanGFX.hpp>
#include <Preferences.h>
#include <driver/i2s_std.h>
#include <math.h>

// ESP32-2432S028R, "Cheap Yellow Display" / CYD
//
// I2S HIRES ADC Audio I2S Capture Card Module:
// - ADC/module is I2S master.
// - ESP32 is I2S slave.
// - Set the module jumper so CLOCK OUT feeds MCLK IN on the module itself.
//
// These GPIOs are the external pins you said you can use. GPIO27 is left free
// because this slave-I2S setup does not need an ESP32 MCLK pin.
static constexpr int PIN_I2S_BCK = 23;
static constexpr int PIN_I2S_WS = 19;
static constexpr int PIN_I2S_DATA = 18;
static constexpr int PIN_I2S_SPARE = 27;
static constexpr i2s_port_t I2S_PORT = I2S_NUM_0;

static constexpr int PIN_LED_R = 4;
static constexpr int PIN_LED_G = 16;
static constexpr int PIN_LED_B = 17;
static constexpr int PIN_BUZZER = 26;
static constexpr bool RGB_LED_ACTIVE_LOW = true;
static constexpr uint8_t RGB_LED_PWM_BITS = 8;
// Keep the RGB LED PWM above the audible range. At 1 kHz, the CYD audio path
// can pick up LED current modulation when CPS changes after pulses.
static constexpr uint16_t RGB_LED_PWM_FREQ = 40000;
static constexpr uint8_t BEEP_PWM_BITS = 8;
static constexpr uint16_t BEEP_PWM_FREQ = 2400;
static constexpr uint8_t BEEP_PWM_DUTY = 128;
static constexpr uint8_t BEEP_MS = 4;
static constexpr uint16_t BLUE_PULSE_FLASH_MS = 25;
static constexpr float CPS_LED_FULL_SCALE = 40.0f;
static constexpr bool TOUCH_MIRROR_X = true;
static constexpr uint8_t LOWPASS_SHIFT = 2;  // 2 = alpha 1/4, mild HF smoothing.
static constexpr uint8_t HYSTERESIS_LOW_DIV = 2;
static constexpr uint8_t TRAP_RISE_DEFAULT = 3;
static constexpr uint8_t TRAP_GAP_DEFAULT = 1;
static constexpr uint8_t TRAP_RISE_MIN = 1;
static constexpr uint8_t TRAP_RISE_MAX = 16;
static constexpr uint8_t TRAP_GAP_MIN = 0;
static constexpr uint8_t TRAP_GAP_MAX = 16;
static constexpr uint8_t TRAP_BUFFER_SIZE = TRAP_RISE_MAX * 2 + TRAP_GAP_MAX + 1;

class CYDDisplay : public lgfx::LGFX_Device {
  lgfx::Panel_ILI9341 panel;
  lgfx::Bus_SPI displayBus;
  lgfx::Light_PWM backlight;
  lgfx::Touch_XPT2046 touch;

public:
  CYDDisplay() {
    {
      auto cfg = displayBus.config();
      cfg.spi_host = HSPI_HOST;
      cfg.spi_mode = 0;
      cfg.freq_write = 40000000;
      cfg.freq_read = 16000000;
      cfg.spi_3wire = false;
      cfg.use_lock = true;
      cfg.dma_channel = 1;
      cfg.pin_sclk = 14;
      cfg.pin_mosi = 13;
      cfg.pin_miso = 12;
      cfg.pin_dc = 2;
      displayBus.config(cfg);
      panel.setBus(&displayBus);
    }

    {
      auto cfg = panel.config();
      cfg.pin_cs = 15;
      cfg.pin_rst = -1;
      cfg.pin_busy = -1;
      cfg.memory_width = 240;
      cfg.memory_height = 320;
      cfg.panel_width = 240;
      cfg.panel_height = 320;
      cfg.offset_x = 0;
      cfg.offset_y = 0;
      cfg.offset_rotation = 0;
      cfg.dummy_read_pixel = 8;
      cfg.dummy_read_bits = 1;
      cfg.readable = true;
      cfg.invert = false;
      cfg.rgb_order = false;
      cfg.dlen_16bit = false;
      cfg.bus_shared = false;
      panel.config(cfg);
    }

    {
      auto cfg = backlight.config();
      cfg.pin_bl = 21;
      cfg.invert = false;
      cfg.freq = 44100;
      cfg.pwm_channel = 7;
      backlight.config(cfg);
      panel.setLight(&backlight);
    }

    {
      auto cfg = touch.config();
      cfg.x_min = 200;
      cfg.x_max = 3700;
      cfg.y_min = 240;
      cfg.y_max = 3800;
      cfg.pin_int = 36;
      cfg.bus_shared = false;
      cfg.offset_rotation = 0;
      cfg.spi_host = VSPI_HOST;
      cfg.freq = 2500000;
      cfg.pin_sclk = 25;
      cfg.pin_mosi = 32;
      cfg.pin_miso = 39;
      cfg.pin_cs = 33;
      touch.config(cfg);
      panel.setTouch(&touch);
    }

    setPanel(&panel);
  }
};

static CYDDisplay lcd;

static constexpr uint16_t C_BLACK = 0x0000;
static constexpr uint16_t C_WHITE = 0xFFFF;
static constexpr uint16_t C_GREEN = 0x07E0;
static constexpr uint16_t C_YELLOW = 0xFFE0;
static constexpr uint16_t C_ORANGE = 0xFD20;
static constexpr uint16_t C_RED = 0xF800;
static constexpr uint16_t C_CYAN = 0x07FF;

static constexpr uint8_t CHANNELS = 2;
static constexpr size_t I2S_FRAMES = 512;
static constexpr uint16_t MAX_PULSE_SAMPLES = 256;
static constexpr uint16_t PRE_TRIGGER_SAMPLES = 10;
static constexpr uint16_t REARM_SAMPLES = 4;
static constexpr uint16_t HISTOGRAM_BINS = 192;
static constexpr uint8_t MAX_PEAK_MARKERS = 6;
static constexpr uint8_t PEAK_MIN_DISTANCE_BINS = 6;
static constexpr uint8_t PEAK_SHOULDER_SPAN = 4;
static constexpr uint16_t SCOPE_COLUMNS = 320;
static constexpr uint16_t SCOPE_SAMPLES_PER_COLUMN = 4;
static constexpr uint8_t BASELINE_SHIFT = 12;

static constexpr uint32_t SAMPLE_RATE_OPTIONS[] = {48000, 96000, 192000};

enum ViewMode {
  VIEW_SPECTRUM,
  VIEW_PULSE,
  VIEW_SCOPE,
  VIEW_SETTINGS
};

struct RuntimeSettings {
  float spectrumMaxFraction = 0.8f;
  float thresholdFraction = 0.007f;
  uint8_t sampleRateIndex = 1;
  uint16_t pulseSamples = 48;
  uint8_t selectedChannel = 0;
  int8_t pulsePolarity = 1;
  bool spectrumLogX = false;
  bool spectrumLogCounts = false;
  bool showHistogram = true;
  bool showSmoothCurve = true;
  bool showEnergy = false;
  bool lowPassEnabled = false;
  bool hysteresisEnabled = true;
  bool trapezoidEnabled = true;
  bool beepEnabled = false;
  uint8_t trapRiseSamples = TRAP_RISE_DEFAULT;
  uint8_t trapGapSamples = TRAP_GAP_DEFAULT;
  uint16_t calibBin1 = 50;
  uint16_t calibBin2 = 100;
  float calibEnergy1 = 200.0f;
  float calibEnergy2 = 400.0f;
};

struct Rect {
  int16_t x;
  int16_t y;
  int16_t w;
  int16_t h;
};

static RuntimeSettings settings;
static ViewMode viewMode = VIEW_SPECTRUM;
static uint8_t settingsPage = 0;
static bool spectrumSettingsSaved = false;
static uint32_t spectrumSettingsSavedUntilMs = 0;

static int32_t i2sFrames[I2S_FRAMES * CHANNELS];
static int32_t pulseBuffer[MAX_PULSE_SAMPLES];
static int32_t preTrigger[PRE_TRIGGER_SAMPLES];
static uint32_t histogram[HISTOGRAM_BINS];
static uint32_t smoothedHistogram[HISTOGRAM_BINS];
static int32_t scopeMin[SCOPE_COLUMNS];
static int32_t scopeMax[SCOPE_COLUMNS];

static size_t framesAvailable = 0;
static size_t frameIndex = 0;
static int64_t baseline = 0;
static int32_t lowPassState = 0;
static int32_t trapBuffer[TRAP_BUFFER_SIZE];
static int64_t trapAccumulator = 0;
static bool baselineReady = false;
static bool lowPassReady = false;
static uint8_t trapIndex = 0;
static uint16_t preIndex = 0;
static uint16_t captureIndex = 0;
static uint16_t rearmCountdown = 0;
static int32_t currentPeak = 0;
static int32_t lastPeak = 0;
static uint32_t pulseCount = 0;
static uint32_t histogramMax = 1;
static uint32_t lastPulseMs = 0;
static uint32_t rateWindowStartMs = 0;
static uint32_t rateWindowPulses = 0;
static float pulsesPerSecond = 0.0f;
static bool pulseReady = false;
static bool paused = false;
static bool i2sInstalled = false;
static i2s_chan_handle_t rxHandle = nullptr;
static bool redrawRequested = true;
static bool wasTouching = false;
static uint32_t blueFlashUntilMs = 0;
static uint32_t beepUntilMs = 0;
static bool beeperPwmAttached = false;

enum DetectorState {
  WAITING_FOR_PULSE,
  CAPTURING_PULSE,
  REARMING_DETECTOR
};

static DetectorState detectorState = WAITING_FOR_PULSE;

static void handleTouch();

static uint32_t sampleRate() {
  return SAMPLE_RATE_OPTIONS[settings.sampleRateIndex];
}

