sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
static int32_t thresholdCounts() {
  return static_cast<int32_t>(2147483647.0f * settings.thresholdFraction);
}

static int32_t histogramFullScaleCounts() {
  float maxFraction = settings.spectrumMaxFraction;
  if (maxFraction < settings.thresholdFraction * 1.2f) {
    maxFraction = settings.thresholdFraction * 1.2f;
  }
  return static_cast<int32_t>(2147483647.0f * maxFraction);
}

static void clampSpectrumSettings() {
  if (settings.calibBin1 >= HISTOGRAM_BINS) settings.calibBin1 = HISTOGRAM_BINS - 1;
  if (settings.calibBin2 >= HISTOGRAM_BINS) settings.calibBin2 = HISTOGRAM_BINS - 1;
  if (settings.calibEnergy1 < 0.0f) settings.calibEnergy1 = 0.0f;
  if (settings.calibEnergy2 < 0.0f) settings.calibEnergy2 = 0.0f;
  if (settings.calibEnergy1 > 9999.0f) settings.calibEnergy1 = 9999.0f;
  if (settings.calibEnergy2 > 9999.0f) settings.calibEnergy2 = 9999.0f;
  if (!settings.showHistogram && !settings.showSmoothCurve) settings.showHistogram = true;
}

static bool calibrationValid() {
  return settings.calibBin1 != settings.calibBin2 &&
         fabsf(settings.calibEnergy1 - settings.calibEnergy2) >= 0.1f;
}

static float energyFromBin(float bin) {
  if (!calibrationValid()) return bin;
  const float slope = (settings.calibEnergy2 - settings.calibEnergy1) /
                      static_cast<float>(settings.calibBin2 - settings.calibBin1);
  return settings.calibEnergy1 + (bin - static_cast<float>(settings.calibBin1)) * slope;
}

static void loadSpectrumPreferences() {
  Preferences prefs;
  if (!prefs.begin("cydspec", true)) return;
  settings.spectrumLogX = prefs.getBool("logx", settings.spectrumLogX);
  settings.spectrumLogCounts = prefs.getBool("logy", settings.spectrumLogCounts);
  settings.showHistogram = prefs.getBool("bars", settings.showHistogram);
  settings.showSmoothCurve = prefs.getBool("curve", settings.showSmoothCurve);
  settings.showEnergy = prefs.getBool("energy", settings.showEnergy);
  settings.calibBin1 = static_cast<uint16_t>(prefs.getUInt("bin1", settings.calibBin1));
  settings.calibBin2 = static_cast<uint16_t>(prefs.getUInt("bin2", settings.calibBin2));
  settings.calibEnergy1 = prefs.getFloat("kev1", settings.calibEnergy1);
  settings.calibEnergy2 = prefs.getFloat("kev2", settings.calibEnergy2);
  prefs.end();
  clampSpectrumSettings();
}

static void saveSpectrumPreferences() {
  Preferences prefs;
  if (!prefs.begin("cydspec", false)) return;
  prefs.putBool("logx", settings.spectrumLogX);
  prefs.putBool("logy", settings.spectrumLogCounts);
  prefs.putBool("bars", settings.showHistogram);
  prefs.putBool("curve", settings.showSmoothCurve);
  prefs.putBool("energy", settings.showEnergy);
  prefs.putUInt("bin1", settings.calibBin1);
  prefs.putUInt("bin2", settings.calibBin2);
  prefs.putFloat("kev1", settings.calibEnergy1);
  prefs.putFloat("kev2", settings.calibEnergy2);
  prefs.end();
  spectrumSettingsSaved = true;
  spectrumSettingsSavedUntilMs = millis() + 1200;
}

static uint32_t pulseWindowUs() {
  return (static_cast<uint32_t>(settings.pulseSamples) * 1000000UL) / sampleRate();
}

static uint16_t colorBg() { return C_BLACK; }
static uint16_t colorPanel() { return 0x1082; }
static uint16_t colorGrid() { return 0x2945; }
static uint16_t colorAxis() { return 0x5AEB; }
static uint16_t colorWave() { return C_GREEN; }
static uint16_t colorAccent() { return C_ORANGE; }
static uint16_t colorText() { return C_WHITE; }

static uint8_t clampByte(int value) {
  if (value < 0) return 0;
  if (value > 255) return 255;
  return static_cast<uint8_t>(value);
}

static uint16_t rgb565(uint8_t r, uint8_t g, uint8_t b) {
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

static void cpsRedGreen(float cps, uint8_t &r, uint8_t &g) {
  float ratio = cps / CPS_LED_FULL_SCALE;
  if (ratio < 0.0f) ratio = 0.0f;
  if (ratio > 1.0f) ratio = 1.0f;
  r = clampByte(static_cast<int>(ratio * 255.0f + 0.5f));
  g = clampByte(static_cast<int>((1.0f - ratio) * 255.0f + 0.5f));
}

static int contentTop() { return 30; }
static int navTop() { return lcd.height() - 40; }
static int contentBottom() { return navTop() - 4; }
static int contentHeight() { return contentBottom() - contentTop() + 1; }
static int screenW() { return lcd.width(); }
static int screenH() { return lcd.height(); }

static void resetDetector() {
  baselineReady = false;
  baseline = 0;
  lowPassReady = false;
  lowPassState = 0;
  trapAccumulator = 0;
  trapIndex = 0;
  for (uint8_t i = 0; i < TRAP_BUFFER_SIZE; i++) {
    trapBuffer[i] = 0;
  }
  preIndex = 0;
  captureIndex = 0;
  rearmCountdown = 0;
  currentPeak = 0;
  pulseReady = false;
  detectorState = WAITING_FOR_PULSE;
  for (uint16_t i = 0; i < PRE_TRIGGER_SAMPLES; i++) {
    preTrigger[i] = 0;
  }
}

static void resetMeasurements() {
  pulseCount = 0;
  lastPeak = 0;
  lastPulseMs = 0;
  histogramMax = 1;
  rateWindowStartMs = millis();
  rateWindowPulses = 0;
  pulsesPerSecond = 0.0f;
  for (uint16_t i = 0; i < HISTOGRAM_BINS; i++) {
    histogram[i] = 0;
  }
  resetDetector();
  redrawRequested = true;
}

static bool setupI2S();

static void restartI2S() {
  if (i2sInstalled) {
    i2s_channel_disable(rxHandle);
    i2s_del_channel(rxHandle);
    rxHandle = nullptr;
    i2sInstalled = false;
  }
  framesAvailable = 0;
  frameIndex = 0;
  resetMeasurements();
  setupI2S();
}

static bool readI2SBlock() {
  size_t bytesRead = 0;
  const esp_err_t err = i2s_channel_read(rxHandle,
                                         reinterpret_cast<void *>(i2sFrames),
                                         sizeof(i2sFrames),
                                         &bytesRead,
                                         100);
  if (err != ESP_OK) {
    framesAvailable = 0;
    frameIndex = 0;
    return false;
  }

  framesAvailable = bytesRead / (sizeof(int32_t) * CHANNELS);
  frameIndex = 0;
  return framesAvailable > 0;
}

static int32_t readSample() {
  while (frameIndex >= framesAvailable) {
    if (!readI2SBlock()) {
      handleTouch();
      delay(1);
    }
  }

  const int32_t sample = i2sFrames[frameIndex * CHANNELS + settings.selectedChannel];
  frameIndex++;
  return sample;
}

static int32_t pulseSignalFromRaw(int32_t rawSample) {
  if (!baselineReady) {
    baseline = rawSample;
    baselineReady = true;
  }

  int64_t signal = (static_cast<int64_t>(rawSample) - baseline) * settings.pulsePolarity;
  if (signal > INT32_MAX) signal = INT32_MAX;
  if (signal < INT32_MIN) signal = INT32_MIN;
  return static_cast<int32_t>(signal);
}

static void updateBaseline(int32_t rawSample) {
  baseline += (static_cast<int64_t>(rawSample) - baseline) / (1L << BASELINE_SHIFT);
}

static int32_t detectionSignal(int32_t rawSignal) {
  int32_t signal = rawSignal;

  if (settings.lowPassEnabled) {
    if (!lowPassReady) {
      lowPassState = rawSignal;
      lowPassReady = true;
    } else {
      lowPassState += static_cast<int32_t>(
          (static_cast<int64_t>(rawSignal) - lowPassState) / (1L << LOWPASS_SHIFT));
    }
    signal = lowPassState;
  } else {
    lowPassReady = false;
  }

  if (!settings.trapezoidEnabled) {
    trapAccumulator = 0;
    trapIndex = 0;
    return signal;
  }

  const uint8_t l = settings.trapRiseSamples;
  const uint8_t g = settings.trapGapSamples;
  const uint8_t i0 = trapIndex;
  const uint8_t iL = (trapIndex + TRAP_BUFFER_SIZE - l) % TRAP_BUFFER_SIZE;
  const uint8_t iLG = (trapIndex + TRAP_BUFFER_SIZE - l - g) % TRAP_BUFFER_SIZE;
  const uint8_t i2LG = (trapIndex + TRAP_BUFFER_SIZE - (2 * l) - g) % TRAP_BUFFER_SIZE;

