sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
  trapAccumulator += static_cast<int64_t>(signal) - trapBuffer[iL] - trapBuffer[iLG] +
                     trapBuffer[i2LG];
  trapBuffer[i0] = signal;
  trapIndex = (trapIndex + 1) % TRAP_BUFFER_SIZE;

  int64_t shaped = trapAccumulator / settings.trapRiseSamples;
  if (shaped > INT32_MAX) shaped = INT32_MAX;
  if (shaped < INT32_MIN) shaped = INT32_MIN;
  return static_cast<int32_t>(shaped);
}

static uint8_t ledDuty(uint8_t logicalDuty) {
  return RGB_LED_ACTIVE_LOW ? 255 - logicalDuty : logicalDuty;
}

static void setupStatusLed() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(PIN_LED_R, RGB_LED_PWM_FREQ, RGB_LED_PWM_BITS);
  ledcAttach(PIN_LED_G, RGB_LED_PWM_FREQ, RGB_LED_PWM_BITS);
  ledcAttach(PIN_LED_B, RGB_LED_PWM_FREQ, RGB_LED_PWM_BITS);
#else
  ledcSetup(0, RGB_LED_PWM_FREQ, RGB_LED_PWM_BITS);
  ledcSetup(1, RGB_LED_PWM_FREQ, RGB_LED_PWM_BITS);
  ledcSetup(2, RGB_LED_PWM_FREQ, RGB_LED_PWM_BITS);
  ledcAttachPin(PIN_LED_R, 0);
  ledcAttachPin(PIN_LED_G, 1);
  ledcAttachPin(PIN_LED_B, 2);
#endif
}

static void setupBeeper() {
  pinMode(PIN_BUZZER, OUTPUT);
  digitalWrite(PIN_BUZZER, LOW);
}

static void writeBeeper(uint8_t duty) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(PIN_BUZZER, duty);
#else
  ledcWrite(3, duty);
#endif
}

static void attachBeeperPwm() {
  if (beeperPwmAttached) return;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(PIN_BUZZER, BEEP_PWM_FREQ, BEEP_PWM_BITS);
#else
  ledcSetup(3, BEEP_PWM_FREQ, BEEP_PWM_BITS);
  ledcAttachPin(PIN_BUZZER, 3);
#endif
  beeperPwmAttached = true;
  writeBeeper(0);
}

static void stopBeeper() {
  if (!beeperPwmAttached && beepUntilMs == 0) return;

  beepUntilMs = 0;
  if (beeperPwmAttached) {
    writeBeeper(0);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcDetach(PIN_BUZZER);
#else
    ledcDetachPin(PIN_BUZZER);
#endif
    beeperPwmAttached = false;
  }
  pinMode(PIN_BUZZER, OUTPUT);
  digitalWrite(PIN_BUZZER, LOW);
}

static void startBeeper() {
  attachBeeperPwm();
  beepUntilMs = millis() + BEEP_MS;
  writeBeeper(BEEP_PWM_DUTY);
}

static void updateBeeper() {
  if (!settings.beepEnabled || static_cast<int32_t>(beepUntilMs - millis()) <= 0) {
    stopBeeper();
  }
}

static void writeStatusLed(uint8_t r, uint8_t g, uint8_t b) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(PIN_LED_R, ledDuty(r));
  ledcWrite(PIN_LED_G, ledDuty(g));
  ledcWrite(PIN_LED_B, ledDuty(b));
#else
  ledcWrite(0, ledDuty(r));
  ledcWrite(1, ledDuty(g));
  ledcWrite(2, ledDuty(b));
#endif
}

static void updateStatusLed() {
  if (static_cast<int32_t>(blueFlashUntilMs - millis()) > 0) {
    writeStatusLed(0, 0, 255);
    return;
  }

  writeStatusLed(0, 0, 0);
}

static void beginPulseCapture(int32_t firstPulseSample) {
  uint16_t out = 0;
  for (uint16_t i = 0; i < PRE_TRIGGER_SAMPLES; i++) {
    const uint16_t index = (preIndex + i) % PRE_TRIGGER_SAMPLES;
    pulseBuffer[out++] = preTrigger[index];
  }

  pulseBuffer[out++] = firstPulseSample;
  captureIndex = out;
  currentPeak = firstPulseSample;
  detectorState = CAPTURING_PULSE;
}

static void finishPulseCapture() {
  lastPeak = currentPeak;
  pulseCount++;
  rateWindowPulses++;
  lastPulseMs = millis();
  blueFlashUntilMs = lastPulseMs + BLUE_PULSE_FLASH_MS;
  if (settings.beepEnabled) {
    startBeeper();
  }

  int32_t peak = lastPeak;
  if (peak < 0) peak = 0;
  const int32_t histogramFullScale = histogramFullScaleCounts();
  if (peak >= histogramFullScale) {
    pulseReady = true;
    rearmCountdown = REARM_SAMPLES;
    detectorState = REARMING_DETECTOR;
    return;
  }
  uint16_t bin = static_cast<uint16_t>(
      (static_cast<uint64_t>(peak) * HISTOGRAM_BINS) / histogramFullScale);
  if (bin >= HISTOGRAM_BINS) {
    bin = HISTOGRAM_BINS - 1;
  }
  histogram[bin]++;
  if (histogram[bin] > histogramMax) {
    histogramMax = histogram[bin];
  }

  pulseReady = true;
  rearmCountdown = REARM_SAMPLES;
  detectorState = REARMING_DETECTOR;
}

static void processSample(int32_t rawSample) {
  const int32_t rawSignal = pulseSignalFromRaw(rawSample);
  const int32_t signal = detectionSignal(rawSignal);

  switch (detectorState) {
    case WAITING_FOR_PULSE:
      if (signal >= thresholdCounts()) {
        beginPulseCapture(signal);
      } else {
        preTrigger[preIndex] = signal;
        preIndex = (preIndex + 1) % PRE_TRIGGER_SAMPLES;
        updateBaseline(rawSample);
      }
      break;

    case CAPTURING_PULSE:
      if (captureIndex < MAX_PULSE_SAMPLES) {
        pulseBuffer[captureIndex++] = signal;
      }
      if (signal > currentPeak) {
        currentPeak = signal;
      }
      if (captureIndex >= settings.pulseSamples || captureIndex >= MAX_PULSE_SAMPLES) {
        finishPulseCapture();
      }
      break;

    case REARMING_DETECTOR:
      if (settings.hysteresisEnabled) {
        if (signal <= thresholdCounts() / HYSTERESIS_LOW_DIV) {
          detectorState = WAITING_FOR_PULSE;
        }
      } else if (rearmCountdown > 0) {
        rearmCountdown--;
      } else {
        detectorState = WAITING_FOR_PULSE;
      }
      break;
  }
}

static void updatePulseRate() {
  const uint32_t now = millis();
  const uint32_t elapsed = now - rateWindowStartMs;
  if (elapsed >= 1000) {
    pulsesPerSecond = static_cast<float>(rateWindowPulses) * 1000.0f /
                      static_cast<float>(elapsed);
    rateWindowPulses = 0;
    rateWindowStartMs = now;
  }
}

static void drawButton(const Rect &r, const char *label, bool active) {
  const uint16_t fill = active ? colorAccent() : colorPanel();
  lcd.fillRoundRect(r.x, r.y, r.w, r.h, 5, fill);
  lcd.drawRoundRect(r.x, r.y, r.w, r.h, 5, colorAxis());
  lcd.setTextColor(active ? C_BLACK : colorText(), fill);
  lcd.setTextDatum(textdatum_t::middle_center);
  lcd.drawString(label, r.x + r.w / 2, r.y + r.h / 2);
  lcd.setTextDatum(textdatum_t::top_left);
}

static Rect navButton(uint8_t index) {
  const int w = screenW() / 4;
  return Rect{static_cast<int16_t>(index * w + 2),
              static_cast<int16_t>(navTop() + 3),
              static_cast<int16_t>(w - 4),
              34};
}

