sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
static Rect spectrumResetButton() {
  const int16_t gaugeX = static_cast<int16_t>(screenW() - 16 - 4);
  return Rect{static_cast<int16_t>(gaugeX - 68),
              static_cast<int16_t>(contentTop() + 8),
              62,
              30};
}

static Rect spectrumConfigShortcutButton() {
  const int16_t gaugeX = static_cast<int16_t>(screenW() - 16 - 4);
  return Rect{static_cast<int16_t>(gaugeX - 68),
              static_cast<int16_t>(contentTop() + 44),
              62,
              30};
}

static Rect pulseBeepButton() {
  return Rect{static_cast<int16_t>(screenW() - 82),
              static_cast<int16_t>(contentTop() + 8),
              72,
              30};
}

static void drawNav() {
  lcd.fillRect(0, navTop(), screenW(), screenH() - navTop(), colorBg());
  drawButton(navButton(0), "Spectrum", viewMode == VIEW_SPECTRUM);
  drawButton(navButton(1), "Pulse", viewMode == VIEW_PULSE);
  drawButton(navButton(2), "Scope", viewMode == VIEW_SCOPE);
  drawButton(navButton(3), "Settings", viewMode == VIEW_SETTINGS);
}

static void drawHeader(const char *title) {
  lcd.fillRect(0, 0, screenW(), contentTop(), colorBg());
  lcd.setTextColor(colorText(), colorBg());
  lcd.setTextDatum(textdatum_t::top_left);
  lcd.drawString(title, 4, 6);
  lcd.setCursor(104, 6);
  lcd.printf("%luk CH%c", sampleRate() / 1000, settings.selectedChannel == 0 ? 'L' : 'R');
  lcd.setCursor(190, 6);
  lcd.printf("%.1f CPS", pulsesPerSecond);
  lcd.setCursor(268, 6);
  lcd.print(paused ? "PAU" : "RUN");
}

static void drawPlotFrame() {
  lcd.fillRect(0, contentTop(), screenW(), contentHeight(), colorBg());
  lcd.drawFastHLine(0, contentTop(), screenW(), colorAxis());
  lcd.drawFastHLine(0, contentBottom(), screenW(), colorAxis());
  for (int x = 0; x < screenW(); x += screenW() / 10) {
    lcd.drawFastVLine(x, contentTop(), contentHeight(), colorGrid());
  }
  for (int y = contentTop(); y <= contentBottom(); y += contentHeight() / 4) {
    lcd.drawFastHLine(0, y, screenW(), colorGrid());
  }
}

static int amplitudeY(int32_t value, int32_t fullScale) {
  if (value < 0) value = 0;
  if (value > fullScale) value = fullScale;
  const float normalized = static_cast<float>(value) / static_cast<float>(fullScale);
  return contentBottom() - static_cast<int>(normalized * (contentHeight() - 4));
}

static uint32_t histogramAtClamped(int index) {
  if (index < 0) index = 0;
  if (index >= HISTOGRAM_BINS) index = HISTOGRAM_BINS - 1;
  return histogram[index];
}

static void buildSmoothedHistogram() {
  for (uint16_t i = 0; i < HISTOGRAM_BINS; i++) {
    const uint64_t weighted =
        histogramAtClamped(i - 2) +
        histogramAtClamped(i - 1) * 2ULL +
        histogramAtClamped(i) * 4ULL +
        histogramAtClamped(i + 1) * 2ULL +
        histogramAtClamped(i + 2);
    smoothedHistogram[i] = static_cast<uint32_t>(weighted / 10ULL);
  }
}

static int spectrumCountY(uint32_t count, float logMax) {
  if (count == 0 || histogramMax == 0) return contentBottom();

  int height = 0;
  if (settings.spectrumLogCounts && logMax > 0.0f) {
    const float normalized = log10f(static_cast<float>(count) + 1.0f) / logMax;
    height = static_cast<int>(normalized * static_cast<float>(contentHeight() - 5));
  } else {
    height = static_cast<int>((static_cast<uint64_t>(count) * (contentHeight() - 5)) /
                              histogramMax);
  }
  if (height < 0) height = 0;
  if (height > contentHeight() - 5) height = contentHeight() - 5;
  return contentBottom() - height + 1;
}

static int spectrumBinValueX(float bin, int plotRight) {
  if (bin < 0.0f) bin = 0.0f;
  if (bin > static_cast<float>(HISTOGRAM_BINS)) bin = static_cast<float>(HISTOGRAM_BINS);

  float normalized = bin / static_cast<float>(HISTOGRAM_BINS);
  if (settings.spectrumLogX) {
    normalized = log10f(1.0f + bin) / log10f(1.0f + static_cast<float>(HISTOGRAM_BINS));
  }
  return static_cast<int>(normalized * static_cast<float>(plotRight));
}

static int spectrumBinEdgeX(uint16_t edge, int plotRight) {
  return spectrumBinValueX(static_cast<float>(edge), plotRight);
}

static int spectrumBinCenterX(uint16_t bin, int plotRight) {
  const int x0 = spectrumBinEdgeX(bin, plotRight);
  const int x1 = spectrumBinEdgeX(bin + 1, plotRight);
  return (x0 + x1) / 2;
}

static void formatSpectrumXLabel(char *label, size_t size, uint16_t bin) {
  if (settings.showEnergy && calibrationValid()) {
    snprintf(label, size, "%.0f", energyFromBin(static_cast<float>(bin)));
  } else {
    snprintf(label, size, "%u", bin);
  }
}

static bool peakTooClose(uint16_t a, uint16_t b) {
  const int delta = static_cast<int>(a) - static_cast<int>(b);
  return (delta < 0 ? -delta : delta) < PEAK_MIN_DISTANCE_BINS;
}

static void insertPeak(uint16_t bin, uint32_t height, uint16_t *peakBins,
                       uint32_t *peakHeights, uint8_t &peakCount) {
  for (uint8_t i = 0; i < peakCount; i++) {
    if (peakTooClose(bin, peakBins[i])) {
      if (height > peakHeights[i]) {
        peakBins[i] = bin;
        peakHeights[i] = height;
      }
      return;
    }
  }

  if (peakCount < MAX_PEAK_MARKERS) {
    peakBins[peakCount] = bin;
    peakHeights[peakCount] = height;
    peakCount++;
    return;
  }

  uint8_t weakest = 0;
  for (uint8_t i = 1; i < peakCount; i++) {
    if (peakHeights[i] < peakHeights[weakest]) weakest = i;
  }
  if (height > peakHeights[weakest]) {
    peakBins[weakest] = bin;
    peakHeights[weakest] = height;
  }
}

static uint8_t findSpectrumPeaks(uint16_t *peakBins, uint32_t *peakHeights) {
  uint8_t peakCount = 0;
  const uint32_t minPeak = histogramMax / 20U > 3U ? histogramMax / 20U : 3U;
  const uint32_t minProminence = histogramMax / 50U > 1U ? histogramMax / 50U : 1U;

  for (uint16_t i = PEAK_SHOULDER_SPAN; i < HISTOGRAM_BINS - PEAK_SHOULDER_SPAN; i++) {
    const uint32_t y = smoothedHistogram[i];
    if (y < minPeak) continue;
    if (!(y >= smoothedHistogram[i - 1] && y > smoothedHistogram[i + 1])) continue;

    const uint32_t leftShoulder = smoothedHistogram[i - PEAK_SHOULDER_SPAN];
    const uint32_t rightShoulder = smoothedHistogram[i + PEAK_SHOULDER_SPAN];
    const uint32_t shoulder = leftShoulder > rightShoulder ? leftShoulder : rightShoulder;
    if (y <= shoulder + minProminence) continue;

    insertPeak(i, y, peakBins, peakHeights, peakCount);
  }

