sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
  return peakCount;
}

static void drawSpectrum() {
  drawHeader("Spectrum");
  drawPlotFrame();

  const int gaugeW = 16;
  const int gaugeX = screenW() - gaugeW - 4;
  const int plotRight = gaugeX - 6;
  const float logMax = log10f(static_cast<float>(histogramMax) + 1.0f);
  buildSmoothedHistogram();

  if (settings.showHistogram) {
    for (uint16_t i = 0; i < HISTOGRAM_BINS; i++) {
      int x0 = spectrumBinEdgeX(i, plotRight);
      int x1 = spectrumBinEdgeX(i + 1, plotRight);
      if (x1 <= x0) x1 = x0 + 1;
      if (x0 >= plotRight) continue;
      if (x1 > plotRight) x1 = plotRight;
      const int barWidth = x1 - x0;
      const int y = spectrumCountY(histogram[i], logMax);
      const int barHeight = contentBottom() - y + 1;
      if (histogram[i] > 0 && barHeight > 0 && barWidth > 0) {
        lcd.fillRect(x0, contentBottom() - barHeight + 1, barWidth, barHeight, colorWave());
      }
    }
  }

  if (settings.showSmoothCurve) {
    int lastSmoothX = spectrumBinCenterX(0, plotRight);
    int lastSmoothY = spectrumCountY(smoothedHistogram[0], logMax);
    for (uint16_t i = 1; i < HISTOGRAM_BINS; i++) {
      const int x = spectrumBinCenterX(i, plotRight);
      const int y = spectrumCountY(smoothedHistogram[i], logMax);
      lcd.drawLine(lastSmoothX, lastSmoothY, x, y, C_CYAN);
      lastSmoothX = x;
      lastSmoothY = y;
    }
  }

  uint16_t peakBins[MAX_PEAK_MARKERS];
  uint32_t peakHeights[MAX_PEAK_MARKERS];
  const uint8_t peakCount = findSpectrumPeaks(peakBins, peakHeights);
  lcd.setTextColor(colorAccent(), colorBg());
  lcd.setTextDatum(textdatum_t::top_left);
  for (uint8_t i = 0; i < peakCount; i++) {
    const int x = spectrumBinCenterX(peakBins[i], plotRight);
    const int y = spectrumCountY(peakHeights[i], logMax);
    int markerTop = y - 5;
    if (markerTop < contentTop() + 2) markerTop = contentTop() + 2;
    lcd.drawFastVLine(x, contentTop() + 2, 9, colorAccent());
    lcd.drawLine(x - 3, contentTop() + 11, x, contentTop() + 15, colorAccent());
    lcd.drawLine(x + 3, contentTop() + 11, x, contentTop() + 15, colorAccent());
    lcd.drawFastVLine(x, markerTop, 11, colorAccent());
    char label[8];
    formatSpectrumXLabel(label, sizeof(label), peakBins[i]);
    int labelX = x - 8;
    if (labelX < 2) labelX = 2;
    if (labelX > plotRight - 20) labelX = plotRight - 20;
    lcd.drawString(label, labelX, contentTop() + 17);
  }

  const float thresholdBin = (static_cast<float>(thresholdCounts()) /
                              static_cast<float>(histogramFullScaleCounts())) *
                             static_cast<float>(HISTOGRAM_BINS);
  const int thresholdX = spectrumBinValueX(thresholdBin, plotRight);
  if (thresholdX >= 0 && thresholdX < plotRight) {
    lcd.drawFastVLine(thresholdX, contentTop(), contentHeight(), colorAxis());
  }

  const float cpsClamped = pulsesPerSecond > CPS_LED_FULL_SCALE ? CPS_LED_FULL_SCALE
                                                                : pulsesPerSecond;
  const int gaugeH = static_cast<int>((cpsClamped / CPS_LED_FULL_SCALE) *
                                      (contentHeight() - 6));
  uint8_t gaugeR = 0;
  uint8_t gaugeG = 0;
  cpsRedGreen(pulsesPerSecond, gaugeR, gaugeG);
  const uint16_t gaugeColor = rgb565(gaugeR, gaugeG, 0);
  lcd.drawRect(gaugeX, contentTop() + 3, gaugeW, contentHeight() - 6, colorAxis());
  if (gaugeH > 0) {
    lcd.fillRect(gaugeX + 2, contentBottom() - gaugeH - 1, gaugeW - 4, gaugeH, gaugeColor);
  }
  lcd.setTextColor(colorText(), colorBg());
  lcd.setTextDatum(textdatum_t::middle_center);
  lcd.drawString("CPS", gaugeX + gaugeW / 2, contentTop() + 14);
  lcd.setTextDatum(textdatum_t::top_left);

  drawButton(spectrumResetButton(), "Reset", false);
  drawButton(spectrumConfigShortcutButton(), "Config", false);

  lcd.setTextColor(colorText(), colorBg());
  lcd.setCursor(4, contentBottom() - 14);
  lcd.printf("N %lu", static_cast<unsigned long>(pulseCount));
  lcd.setCursor(78, contentBottom() - 14);
  lcd.printf("Zoom %.0f%%", settings.spectrumMaxFraction * 100.0f);
  lcd.setCursor(162, contentBottom() - 14);
  lcd.printf("%s %s", settings.spectrumLogX ? "LX" : "X",
             settings.spectrumLogCounts ? "LY" : "Y");
  lcd.setCursor(214, contentBottom() - 14);
  lcd.print(settings.showEnergy && calibrationValid() ? "keV" : "bin");
  lcd.setCursor(244, contentBottom() - 14);
  lcd.printf("%.1f CPS", pulsesPerSecond);
  drawNav();
}

static void drawPulse() {
  drawHeader("Pulse");
  drawPlotFrame();

  const int64_t scaledPeak = static_cast<int64_t>(lastPeak) * 6 / 5;
  int32_t fullScale = lastPeak > thresholdCounts()
                          ? (scaledPeak > INT32_MAX ? INT32_MAX : static_cast<int32_t>(scaledPeak))
                          : thresholdCounts() * 2;
  if (fullScale <= 0) fullScale = thresholdCounts() * 2;

  const int thresholdY = amplitudeY(thresholdCounts(), fullScale);
  lcd.drawFastHLine(0, thresholdY, screenW(), colorAxis());
  drawButton(pulseBeepButton(), settings.beepEnabled ? "Bip ON" : "Bip OFF",
             settings.beepEnabled);

  if (pulseCount > 0 && lastPeak > 0) {
    int lastX = 0;
    int lastY = amplitudeY(pulseBuffer[0], fullScale);
    const uint16_t samples = settings.pulseSamples;
    for (uint16_t i = 1; i < samples; i++) {
      const int x = static_cast<int>((static_cast<uint32_t>(i) * (screenW() - 1)) / (samples - 1));
      const int y = amplitudeY(pulseBuffer[i], fullScale);
      lcd.drawLine(lastX, lastY, x, y, colorWave());
      lastX = x;
      lastY = y;
    }
  } else {
    lcd.setTextColor(colorText(), colorBg());
    lcd.drawString("Waiting for pulse", 92, 104);
  }

  const float peakPercent = (static_cast<float>(lastPeak) / 2147483648.0f) * 100.0f;
  lcd.setTextColor(colorText(), colorBg());
  lcd.setCursor(4, contentBottom() - 14);
  lcd.printf("Peak %.2f%%FS", peakPercent);
  lcd.setCursor(122, contentBottom() - 14);
  lcd.printf("Window %luus", static_cast<unsigned long>(pulseWindowUs()));
  drawNav();
}

static void acquireScopeFrame() {
  for (int x = 0; x < screenW() && x < SCOPE_COLUMNS; x++) {
    int32_t mn = INT32_MAX;
    int32_t mx = INT32_MIN;
    for (uint16_t i = 0; i < SCOPE_SAMPLES_PER_COLUMN; i++) {
      const int32_t signal = pulseSignalFromRaw(readSample());
      if (signal < mn) mn = signal;
      if (signal > mx) mx = signal;
    }
    scopeMin[x] = mn;
    scopeMax[x] = mx;
  }
}

static void drawScope() {
  acquireScopeFrame();
  drawHeader("Scope");
  drawPlotFrame();

  int32_t fullScale = histogramFullScaleCounts();
  if (fullScale < thresholdCounts() * 2) fullScale = thresholdCounts() * 2;
  const int zeroY = amplitudeY(0, fullScale);
  const int thresholdY = amplitudeY(thresholdCounts(), fullScale);
  lcd.drawFastHLine(0, zeroY, screenW(), colorAxis());
  lcd.drawFastHLine(0, thresholdY, screenW(), colorAxis());

