sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
  for (int x = 0; x < screenW() && x < SCOPE_COLUMNS; x++) {
    const int y1 = amplitudeY(scopeMin[x], fullScale);
    const int y2 = amplitudeY(scopeMax[x], fullScale);
    const int top = y1 < y2 ? y1 : y2;
    const int bottom = y1 > y2 ? y1 : y2;
    lcd.drawFastVLine(x, top, bottom - top + 1, colorWave());
  }

  lcd.setTextColor(colorText(), colorBg());
  lcd.setCursor(4, contentBottom() - 14);
  const float usPerDiv = (static_cast<float>(SCOPE_SAMPLES_PER_COLUMN) *
                          static_cast<float>(screenW()) * 1000000.0f) /
                         (10.0f * static_cast<float>(sampleRate()));
  const float yPercentPerDiv = (static_cast<float>(fullScale) / 2147483648.0f) *
                               100.0f / 4.0f;
  if (usPerDiv >= 1000.0f) {
    lcd.printf("X %.1fms/div  Y %.2f%%FS/div", usPerDiv / 1000.0f, yPercentPerDiv);
  } else {
    lcd.printf("X %.0fus/div  Y %.2f%%FS/div", usPerDiv, yPercentPerDiv);
  }
  drawNav();
}

static Rect settingButton(uint8_t row, uint8_t col) {
  return Rect{static_cast<int16_t>(col == 0 ? 212 : 266),
              static_cast<int16_t>(38 + row * 31),
              46,
              26};
}

static Rect settingsPageButton() {
  return Rect{178, 166, 62, 28};
}

static Rect spectrumSettingsPageButton() {
  return Rect{248, 166, 62, 28};
}

static Rect filterPageButton(uint8_t index) {
  const int16_t x = index % 2 == 0 ? 8 : 164;
  const int16_t y = index < 2 ? 36 : 78;
  return Rect{x, y, 148, 38};
}

static Rect trapAdjustButton(uint8_t row, uint8_t col) {
  return Rect{static_cast<int16_t>(col == 0 ? 176 : 242),
              static_cast<int16_t>(124 + row * 28),
              56,
              24};
}

static Rect spectrumOptionButton(uint8_t index) {
  if (index < 4) {
    return Rect{static_cast<int16_t>(8 + index * 78), 36, 72, 28};
  }
  const int16_t x = index == 4 ? 8 : (index == 5 ? 112 : 216);
  return Rect{x, 68, 96, 28};
}

static Rect spectrumCalButton(uint8_t row, uint8_t col) {
  return Rect{static_cast<int16_t>(col == 0 ? 224 : 274),
              static_cast<int16_t>(105 + row * 23),
              40,
              21};
}

static void drawSettingRow(uint8_t row, const char *label, const char *value) {
  const int y = 45 + row * 31;
  lcd.setTextColor(colorText(), colorBg());
  lcd.drawString(label, 10, y);
  lcd.setTextColor(colorAccent(), colorBg());
  lcd.drawString(value, 118, y);
  drawButton(settingButton(row, 0), "-", false);
  drawButton(settingButton(row, 1), "+", false);
}

static void drawGeneralSettings() {
  drawHeader("Settings");
  lcd.fillRect(0, contentTop(), screenW(), contentHeight(), colorBg());

  char value[32];
  snprintf(value, sizeof(value), "%.0f%% FS", settings.spectrumMaxFraction * 100.0f);
  drawSettingRow(0, "Spectrum zoom", value);

  snprintf(value, sizeof(value), "%.1f%% FS", settings.thresholdFraction * 100.0f);
  drawSettingRow(1, "Noise threshold", value);

  snprintf(value, sizeof(value), "%lu kHz", sampleRate() / 1000);
  drawSettingRow(2, "Sample rate", value);

  snprintf(value, sizeof(value), "%lu us", static_cast<unsigned long>(pulseWindowUs()));
  drawSettingRow(3, "Pulse window", value);

  drawButton(settingsPageButton(), "Filters", false);
  drawButton(spectrumSettingsPageButton(), "Spectrum", false);

  lcd.setTextColor(colorText(), colorBg());
  lcd.setCursor(10, 194);
  lcd.printf("Pulses %lu", static_cast<unsigned long>(pulseCount));
  drawNav();
}

static void drawFilterSettings() {
  drawHeader("Filters");
  lcd.fillRect(0, contentTop(), screenW(), contentHeight(), colorBg());

  drawButton(filterPageButton(0), settings.lowPassEnabled ? "HF ON" : "HF OFF",
             settings.lowPassEnabled);
  drawButton(filterPageButton(1), settings.hysteresisEnabled ? "Hyst ON" : "Hyst OFF",
             settings.hysteresisEnabled);
  drawButton(filterPageButton(2), settings.trapezoidEnabled ? "Trap ON" : "Trap OFF",
             settings.trapezoidEnabled);
  drawButton(filterPageButton(3), "Back", false);

  lcd.setTextColor(colorText(), colorBg());
  lcd.drawString("Rise", 10, 130);
  lcd.setTextColor(colorAccent(), colorBg());
  lcd.setCursor(96, 130);
  lcd.printf("%u", static_cast<unsigned>(settings.trapRiseSamples));
  drawButton(trapAdjustButton(0, 0), "-", false);
  drawButton(trapAdjustButton(0, 1), "+", false);

  lcd.setTextColor(colorText(), colorBg());
  lcd.drawString("Gap", 10, 158);
  lcd.setTextColor(colorAccent(), colorBg());
  lcd.setCursor(96, 158);
  lcd.printf("%u", static_cast<unsigned>(settings.trapGapSamples));
  drawButton(trapAdjustButton(1, 0), "-", false);
  drawButton(trapAdjustButton(1, 1), "+", false);

  lcd.setTextColor(colorText(), colorBg());
  lcd.setCursor(10, 184);
  lcd.printf("LP 1/%u  Hyst 1/%u",
             static_cast<unsigned>(1U << LOWPASS_SHIFT),
             static_cast<unsigned>(HYSTERESIS_LOW_DIV));
  drawNav();
}

static void drawSpectrumCalRow(uint8_t row, const char *label, const char *value) {
  const int y = 109 + row * 23;
  lcd.setTextColor(colorText(), colorBg());
  lcd.drawString(label, 10, y);
  lcd.setTextColor(colorAccent(), colorBg());
  lcd.drawString(value, 96, y);
  drawButton(spectrumCalButton(row, 0), "-", false);
  drawButton(spectrumCalButton(row, 1), "+", false);
}

static void drawSpectrumSettings() {
  drawHeader("Spectrum");
  lcd.fillRect(0, contentTop(), screenW(), contentHeight(), colorBg());

  drawButton(spectrumOptionButton(0), "LogX", settings.spectrumLogX);
  drawButton(spectrumOptionButton(1), "LogY", settings.spectrumLogCounts);
  drawButton(spectrumOptionButton(2), "Bars", settings.showHistogram);
  drawButton(spectrumOptionButton(3), "Curve", settings.showSmoothCurve);
  drawButton(spectrumOptionButton(4), settings.showEnergy ? "Energy" : "Bins",
             settings.showEnergy && calibrationValid());
  drawButton(spectrumOptionButton(5), spectrumSettingsSaved ? "Saved" : "Save",
             spectrumSettingsSaved);
  drawButton(spectrumOptionButton(6), "Back", false);

  char value[24];
  snprintf(value, sizeof(value), "%u", static_cast<unsigned>(settings.calibBin1));
  drawSpectrumCalRow(0, "P1 bin", value);
  snprintf(value, sizeof(value), "%.0f keV", settings.calibEnergy1);
  drawSpectrumCalRow(1, "P1 energy", value);
  snprintf(value, sizeof(value), "%u", static_cast<unsigned>(settings.calibBin2));
  drawSpectrumCalRow(2, "P2 bin", value);
  snprintf(value, sizeof(value), "%.0f keV", settings.calibEnergy2);
  drawSpectrumCalRow(3, "P2 energy", value);

  lcd.setTextColor(calibrationValid() ? colorText() : C_RED, colorBg());
  lcd.setCursor(10, 96);
  if (calibrationValid()) {
    lcd.printf("Cal %.0f..%.0f keV", energyFromBin(0.0f),
               energyFromBin(static_cast<float>(HISTOGRAM_BINS - 1)));
  } else {
    lcd.print("Calibration needs two distinct points");
  }
  drawNav();
}

