sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
static void drawSettings() {
  if (settingsPage == 0) {
    drawGeneralSettings();
  } else if (settingsPage == 1) {
    drawFilterSettings();
  } else {
    drawSpectrumSettings();
  }
}

static void drawCurrentView() {
  switch (viewMode) {
    case VIEW_SPECTRUM:
      drawSpectrum();
      break;
    case VIEW_PULSE:
      drawPulse();
      break;
    case VIEW_SCOPE:
      drawScope();
      break;
    case VIEW_SETTINGS:
      drawSettings();
      break;
  }
  redrawRequested = false;
}

static bool contains(const Rect &r, int x, int y) {
  return x >= r.x && x < r.x + r.w && y >= r.y && y < r.y + r.h;
}

static void adjustSetting(uint8_t row, int8_t delta) {
  switch (row) {
    case 0:
      settings.spectrumMaxFraction += delta * 0.01f;
      if (settings.spectrumMaxFraction < 0.01f) settings.spectrumMaxFraction = 0.01f;
      if (settings.spectrumMaxFraction > 1.0f) settings.spectrumMaxFraction = 1.0f;
      resetMeasurements();
      break;
    case 1:
      settings.thresholdFraction += delta * 0.001f;
      if (settings.thresholdFraction < 0.0025f) settings.thresholdFraction = 0.0025f;
      if (settings.thresholdFraction > 0.25f) settings.thresholdFraction = 0.25f;
      resetDetector();
      break;
    case 2:
      if (delta > 0 && settings.sampleRateIndex < 2) settings.sampleRateIndex++;
      if (delta < 0 && settings.sampleRateIndex > 0) settings.sampleRateIndex--;
      restartI2S();
      return;
    case 3: {
      int32_t samples = settings.pulseSamples + delta * 16;
      if (samples < 32) samples = 32;
      if (samples > MAX_PULSE_SAMPLES) samples = MAX_PULSE_SAMPLES;
      settings.pulseSamples = static_cast<uint16_t>(samples);
      resetDetector();
      break;
    }
    case 4:
      settings.lowPassEnabled = !settings.lowPassEnabled;
      resetMeasurements();
      break;
    case 5:
      settings.hysteresisEnabled = !settings.hysteresisEnabled;
      resetMeasurements();
      break;
    case 6:
      settings.trapezoidEnabled = !settings.trapezoidEnabled;
      resetMeasurements();
      break;
    case 7: {
      int32_t value = settings.trapRiseSamples + delta;
      if (value < TRAP_RISE_MIN) value = TRAP_RISE_MIN;
      if (value > TRAP_RISE_MAX) value = TRAP_RISE_MAX;
      settings.trapRiseSamples = static_cast<uint8_t>(value);
      resetMeasurements();
      break;
    }
    case 8: {
      int32_t value = settings.trapGapSamples + delta;
      if (value < TRAP_GAP_MIN) value = TRAP_GAP_MIN;
      if (value > TRAP_GAP_MAX) value = TRAP_GAP_MAX;
      settings.trapGapSamples = static_cast<uint8_t>(value);
      resetMeasurements();
      break;
    }
  }
  redrawRequested = true;
}

static void adjustSpectrumCalibration(uint8_t row, int8_t delta) {
  spectrumSettingsSaved = false;
  switch (row) {
    case 0: {
      int32_t value = static_cast<int32_t>(settings.calibBin1) + delta;
      if (value < 0) value = 0;
      if (value >= HISTOGRAM_BINS) value = HISTOGRAM_BINS - 1;
      settings.calibBin1 = static_cast<uint16_t>(value);
      break;
    }
    case 1:
      settings.calibEnergy1 += static_cast<float>(delta);
      break;
    case 2: {
      int32_t value = static_cast<int32_t>(settings.calibBin2) + delta;
      if (value < 0) value = 0;
      if (value >= HISTOGRAM_BINS) value = HISTOGRAM_BINS - 1;
      settings.calibBin2 = static_cast<uint16_t>(value);
      break;
    }
    case 3:
      settings.calibEnergy2 += static_cast<float>(delta);
      break;
  }
  clampSpectrumSettings();
  redrawRequested = true;
}

static void toggleSpectrumOption(uint8_t index) {
  spectrumSettingsSaved = false;
  switch (index) {
    case 0:
      settings.spectrumLogX = !settings.spectrumLogX;
      break;
    case 1:
      settings.spectrumLogCounts = !settings.spectrumLogCounts;
      break;
    case 2:
      settings.showHistogram = !settings.showHistogram;
      if (!settings.showHistogram && !settings.showSmoothCurve) settings.showSmoothCurve = true;
      break;
    case 3:
      settings.showSmoothCurve = !settings.showSmoothCurve;
      if (!settings.showHistogram && !settings.showSmoothCurve) settings.showHistogram = true;
      break;
    case 4:
      settings.showEnergy = !settings.showEnergy;
      break;
    case 5:
      saveSpectrumPreferences();
      break;
    case 6:
      settingsPage = 0;
      break;
  }
  redrawRequested = true;
}

static void handleTouch() {
  int32_t tx = 0;
  int32_t ty = 0;
  const bool touching = lcd.getTouch(&tx, &ty);
  if (!touching) {
    wasTouching = false;
    return;
  }
  if (wasTouching) {
    return;
  }
  wasTouching = true;

  const int x = TOUCH_MIRROR_X ? screenW() - 1 - tx : tx;
  const int y = ty;

  if (viewMode == VIEW_SPECTRUM && contains(spectrumResetButton(), x, y)) {
    resetMeasurements();
    return;
  }
  if (viewMode == VIEW_SPECTRUM && contains(spectrumConfigShortcutButton(), x, y)) {
    viewMode = VIEW_SETTINGS;
    settingsPage = 2;
    redrawRequested = true;
    return;
  }
  if (viewMode == VIEW_PULSE && contains(pulseBeepButton(), x, y)) {
    settings.beepEnabled = !settings.beepEnabled;
    stopBeeper();
    redrawRequested = true;
    return;
  }

  for (uint8_t i = 0; i < 4; i++) {
    if (contains(navButton(i), x, y)) {
      viewMode = static_cast<ViewMode>(i);
      redrawRequested = true;
      return;
    }
  }

  if (viewMode == VIEW_SETTINGS && settingsPage == 0) {
    if (contains(settingsPageButton(), x, y)) {
      settingsPage = 1;
      redrawRequested = true;
      return;
    }
    if (contains(spectrumSettingsPageButton(), x, y)) {
      settingsPage = 2;
      redrawRequested = true;
      return;
    }
    for (uint8_t row = 0; row < 4; row++) {
      if (contains(settingButton(row, 0), x, y)) {
        adjustSetting(row, -1);
        return;
      }
      if (contains(settingButton(row, 1), x, y)) {
        adjustSetting(row, 1);
        return;
      }
    }
  } else if (viewMode == VIEW_SETTINGS && settingsPage == 1) {
    for (uint8_t index = 0; index < 4; index++) {
      if (contains(filterPageButton(index), x, y)) {
        if (index == 3) {
          settingsPage = 0;
          redrawRequested = true;
        } else {
          adjustSetting(index + 4, 0);
        }
        return;
      }
    }
    for (uint8_t row = 0; row < 2; row++) {
      if (contains(trapAdjustButton(row, 0), x, y)) {
        adjustSetting(row == 0 ? 7 : 8, -1);
        return;
      }
      if (contains(trapAdjustButton(row, 1), x, y)) {
        adjustSetting(row == 0 ? 7 : 8, 1);
        return;
      }
    }
  } else if (viewMode == VIEW_SETTINGS && settingsPage == 2) {
    for (uint8_t index = 0; index < 7; index++) {
      if (contains(spectrumOptionButton(index), x, y)) {
        toggleSpectrumOption(index);
        return;
      }
    }
    for (uint8_t row = 0; row < 4; row++) {
      if (contains(spectrumCalButton(row, 0), x, y)) {
        adjustSpectrumCalibration(row, -1);
        return;
      }
      if (contains(spectrumCalButton(row, 1), x, y)) {
        adjustSpectrumCalibration(row, 1);
        return;
      }
    }
  }
}

static bool setupI2S() {
  Serial.printf("I2S ADC config: CYD, port=%d RX SLAVE, %lu Hz, 32 bit, stereo, APLL on\n",
                static_cast<int>(I2S_PORT), sampleRate());
  Serial.printf("I2S pins: BCK=%d WS=%d DATA=%d spare=%d\n",
                PIN_I2S_BCK, PIN_I2S_WS, PIN_I2S_DATA, PIN_I2S_SPARE);

