sylvainf/ESP32-Gamma-Spectrometer/CYD_GammaSpectrometer.ino
  i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_PORT, I2S_ROLE_SLAVE);
  chan_cfg.dma_desc_num = 12;
  chan_cfg.dma_frame_num = 128;
  chan_cfg.intr_priority = 1;

  esp_err_t err = i2s_new_channel(&chan_cfg, nullptr, &rxHandle);
  if (err != ESP_OK) {
    Serial.printf("i2s_new_channel failed: %d\n", static_cast<int>(err));
  }

  if (err == ESP_OK) {
    i2s_std_config_t std_cfg = {
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(sampleRate()),
        .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_32BIT,
                                                        I2S_SLOT_MODE_STEREO),
        .gpio_cfg = {
            .mclk = I2S_GPIO_UNUSED,
            .bclk = static_cast<gpio_num_t>(PIN_I2S_BCK),
            .ws = static_cast<gpio_num_t>(PIN_I2S_WS),
            .dout = I2S_GPIO_UNUSED,
            .din = static_cast<gpio_num_t>(PIN_I2S_DATA),
            .invert_flags = {
                .mclk_inv = false,
                .bclk_inv = false,
                .ws_inv = false,
            },
        },
    };
    std_cfg.clk_cfg.clk_src = I2S_CLK_SRC_APLL;

    err = i2s_channel_init_std_mode(rxHandle, &std_cfg);
    if (err != ESP_OK) {
      Serial.printf("i2s_channel_init_std_mode failed: %d\n", static_cast<int>(err));
    }
  }

  if (err == ESP_OK) {
    err = i2s_channel_enable(rxHandle);
    if (err != ESP_OK) {
      Serial.printf("i2s_channel_enable failed: %d\n", static_cast<int>(err));
    }
  }

  i2sInstalled = err == ESP_OK;
  return i2sInstalled;
}

void setup() {
  Serial.begin(115200);
  delay(200);

  loadSpectrumPreferences();
  setupStatusLed();
  setupBeeper();
  updateStatusLed();

  lcd.init();
  lcd.setRotation(1);
  lcd.setBrightness(255);
  lcd.fillScreen(colorBg());
  lcd.setTextSize(1);
  lcd.setTextDatum(textdatum_t::top_left);
  resetMeasurements();
  if (!setupI2S()) {
    lcd.fillScreen(C_RED);
    lcd.setTextColor(C_WHITE, C_RED);
    lcd.drawString("I2S begin failed", 90, 110);
    while (true) {
      delay(1000);
    }
  }
  drawCurrentView();
}

void loop() {
  handleTouch();
  updatePulseRate();
  updateStatusLed();
  updateBeeper();
  if (spectrumSettingsSaved &&
      static_cast<int32_t>(spectrumSettingsSavedUntilMs - millis()) <= 0) {
    spectrumSettingsSaved = false;
    redrawRequested = true;
  }

  bool pulseSeen = false;
  if (!paused) {
    for (uint16_t i = 0; i < I2S_FRAMES; i++) {
      processSample(readSample());
      if (pulseReady) {
        pulseReady = false;
        pulseSeen = true;
        updateStatusLed();
      }
    }
  }

  static uint32_t lastRefreshMs = 0;
  static uint32_t lastPulseRedrawMs = 0;
  const uint32_t now = millis();
  if (pulseSeen && viewMode == VIEW_PULSE && now - lastPulseRedrawMs >= 100) {
    redrawRequested = true;
    lastPulseRedrawMs = now;
  }
  const uint16_t refresh = viewMode == VIEW_SCOPE ? 160 : 500;
  if (redrawRequested || now - lastRefreshMs >= refresh) {
    drawCurrentView();
    lastRefreshMs = now;
  }
}
